doc/am/design/images/request_seq.pu
@startuml

participant client
participant server

client -> server : request
server --> client : reply
client -> client : react

@enduml
