doc/am/design/images/three_request.msc
msc {
    a [label="client"], b [label="server"];

    a => b [label="request message"];
    b => a [label="reply message"];
    a => a [label="react to reply"];
}
